[net]
batch=1
channels=3
height=384
width=128

[convolutional]
filters=64
size=7
stride=2
pad=3
batch_normalize=1
activation=relu

[maxpool]
size_h=3
size_w=3
stride_h=2
stride_w=2
padding=1

[convolutional]
filters=64
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=64
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[route]
layers=-4

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-3
activation=relu

[convolutional]
filters=64
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=64
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=64
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=64
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=128
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=128
size=3
stride=2
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=512
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[route]
layers=-4

[convolutional]
filters=512
size=1
stride=2
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-3
activation=relu

[convolutional]
filters=128
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=128
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=512
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=128
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=128
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=512
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=128
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=128
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=512
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=256
size=3
stride=2
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=1024
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[route]
layers=-4

[convolutional]
filters=1024
size=1
stride=2
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-3
activation=relu

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=1024
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=1024
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=1024
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=1024
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=1024
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=512
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=512
size=3
stride=2
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=2048
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[route]
layers=-4

[convolutional]
filters=2048
size=1
stride=2
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-3
activation=relu

[convolutional]
filters=512
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=512
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=2048
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=512
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=512
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=2048
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[maxpool]
size_h=12
size_w=4
stride_h=12
stride_w=4

[route]
layers=-36

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=1024
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-40
activation=relu

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=1024
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=1024
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=1024
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=1024
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=512
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=512
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=2048
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[route]
layers=-4

[convolutional]
filters=2048
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-3
activation=relu

[convolutional]
filters=512
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=512
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=2048
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=512
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=512
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=2048
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[maxpool]
size_h=24
size_w=8
stride_h=24
stride_w=8

[route]
layers=-72

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=1024
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-76
activation=relu

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=1024
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=1024
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=1024
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=1024
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=512
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=512
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=2048
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[route]
layers=-4

[convolutional]
filters=2048
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-3
activation=relu

[convolutional]
filters=512
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=512
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=2048
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=512
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[convolutional]
filters=512
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=2048
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[maxpool]
size_h=24
size_w=8
stride_h=24
stride_w=8

[route]
layers=-38

[maxpool]
size_h=12
size_w=8
stride_h=12
stride_w=8

[route]
layers=-1

[slice]
slice_axis=2
slice_num=1
slice_pos=0

[route]
layers=-3

[slice]
slice_axis=2
slice_num=1
slice_pos=1

[route]
layers=-8

[maxpool]
size_h=8
size_w=8
stride_h=8
stride_w=8

[route]
layers=-1

[slice]
slice_axis=2
slice_num=2
slice_pos=0

[route]
layers=-3

[slice]
slice_axis=2
slice_num=2
slice_pos=1

[route]
layers=-5

[slice]
slice_axis=2
slice_num=2
slice_pos=2

[route]
layers=-87

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[route]
layers=-53

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[route]
layers=-15

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[route]
layers=-15

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[route]
layers=-23

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[route]
layers=-15

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[route]
layers=-15

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[route]
layers=-15

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=1
activation=relu

[route]
layers=-15,-13,-7,-11,-9,-5,-3,-1

